# Lab | SQL Select

## Load extensions

In [1]:
%load_ext sql

## Connect to the database

In [2]:
# Windows

In [3]:
%sql sqlite:///publications.db

## Get list of tables

In [4]:
# %config SqlMagic.style = 'ALL'

In [5]:
# List of tables

In [6]:
%%sql
select name 
from sqlite_master
where type='table'
order by name;

 * sqlite:///publications.db
Done.

[('authors',),
 ('discounts',),
 ('employee',),
 ('jobs',),
 ('pub_info',),
 ('publishers',),
 ('roysched',),
 ('sales',),
 ('stores',),
 ('titleauthor',),
 ('titles',)]

![Image](https://github.com/ironhack-bcn-data-june-2020/20-lab-sql-select/blob/master/authors.png?raw=true)

In [7]:
# Authors table

In [8]:
%%sql
select *
from authors
limit 5

 * sqlite:///publications.db
Done.

[('172-32-1176', 'White', 'Johnson', '408 496-7223', '10932 Bigge Rd.', 'Menlo Park', 'CA', '94025', 1),
 ('213-46-8915', 'Green', 'Marjorie', '415 986-7020', '309 63rd St. #411', 'Oakland', 'CA', '94618', 1),
 ('238-95-7766', 'Carson', 'Cheryl', '415 548-7723', '589 Darwin Ln.', 'Berkeley', 'CA', '94705', 1),
 ('267-41-2394', "O'Leary", 'Michael', '408 286-2428', '22 Cleveland Av. #14', 'San Jose', 'CA', '95128', 1),
 ('274-80-9391', 'Straight', 'Dean', '415 834-2919', '5420 College Av.', 'Oakland', 'CA', '94609', 1)]

In [9]:
# Title table

In [10]:
%%sql
select *
from titles
limit 5

 * sqlite:///publications.db
Done.

[('BU1032', "The Busy Executive's Database Guide", 'business', '1389', 19.99, 5000, 10, 4095, 'An overview of available database systems with emphasis on common business applications. Illustrated.', '1991-06-12 00:00:00'),
 ('BU1111', 'Cooking with Computers: Surreptitious Balance Sheets', 'business', '1389', 11.95, 5000, 10, 3876, 'Helpful hints on how to use your electronic resources to the best advantage.', '1991-06-09 00:00:00'),
 ('BU2075', 'You Can Combat Computer Stress!', 'business', '0736', 2.99, 10125, 24, 18722, 'The latest medical and psychological techniques for living with the electronic office. Easy-to-understand explanations.', '1991-06-30 00:00:00'),
 ('BU7832', 'Straight Talk About Computers', 'business', '1389', 19.99, 5000, 10, 4095, 'Annotated analysis of what computers can do for you: a no-hype guide for the critical user.', '1991-06-22 00:00:00'),
 ('MC2222', 'Silicon Valley Gastronomic Treats', 'mod_cook', '0877', 19.99, 0, 12, 2032, 'Favorite recipes for quick, easy, and elegant meals.', '1991-06-09 00:00:00')]

In [11]:
%%sql
select *
from titleauthor
order by title_id
limit 5

 * sqlite:///publications.db
Done.

[('213-46-8915', 'BU1032', 2, 40),
 ('409-56-7008', 'BU1032', 1, 60),
 ('267-41-2394', 'BU1111', 2, 40),
 ('724-80-9391', 'BU1111', 1, 60),
 ('213-46-8915', 'BU2075', 1, 100)]

In [12]:
%%sql
select *
from titleauthor
order by au_id
limit 5

 * sqlite:///publications.db
Done.

[('172-32-1176', 'PS3333', 1, 100),
 ('213-46-8915', 'BU1032', 2, 40),
 ('213-46-8915', 'BU2075', 1, 100),
 ('238-95-7766', 'PC1035', 1, 100),
 ('267-41-2394', 'BU1111', 2, 40)]

## Challenge 1 - Who Have Published What At Where?

Find at least the following columns:

- AUTHOR_ID - the ID of the author
- LAST_NAME - author last name
- FIRST_NAME - author first name
- TITLE - name of the published title
- PUBLISHER - name of the publisher where the title was published

If your query is correct, the total rows in your output should be the same as the total number of records in Table titleauthor.

In [19]:
# check total number of records in Table titleauthor

In [14]:
%%sql
select count(*)
from titleauthor

 * sqlite:///publications.db
Done.

[(25,)]

In [22]:
%%sql
select  a.au_id as 'AUTHOR ID', 
        a.au_lname as 'LAST NAME', 
        a.au_fname as 'FIRST NAME', 
        t.title as 'TITLE', 
        p.pub_name as 'PUBLISHER'
from authors as a join titleauthor as ta on a.au_id = ta.au_id
               join titles as t on t.title_id = ta.title_id
               join publishers as p on p.pub_id = t.pub_id

 * sqlite:///publications.db
Done.

[('172-32-1176', 'White', 'Johnson', 'Prolonged Data Deprivation: Four Case Studies', 'New Moon Books'),
 ('213-46-8915', 'Green', 'Marjorie', "The Busy Executive's Database Guide", 'Algodata Infosystems'),
 ('213-46-8915', 'Green', 'Marjorie', 'You Can Combat Computer Stress!', 'New Moon Books'),
 ('238-95-7766', 'Carson', 'Cheryl', 'But Is It User Friendly?', 'Algodata Infosystems'),
 ('267-41-2394', "O'Leary", 'Michael', 'Cooking with Computers: Surreptitious Balance Sheets', 'Algodata Infosystems'),
 ('267-41-2394', "O'Leary", 'Michael', 'Sushi, Anyone?', 'Binnet & Hardley'),
 ('274-80-9391', 'Straight', 'Dean', 'Straight Talk About Computers', 'Algodata Infosystems'),
 ('409-56-7008', 'Bennet', 'Abraham', "The Busy Executive's Database Guide", 'Algodata Infosystems'),
 ('427-17-2319', 'Dull', 'Ann', 'Secrets of Silicon Valley', 'Algodata Infosystems'),
 ('472-27-2349', 'Gringlesby', 'Burt', 'Sushi, Anyone?', 'Binnet & Hardley'),
 ('486-29-1786', 'Locksley', 'Charlene', 'Net Etiquette', 'Algodata Infosystems'),
 ('486-29-1786', 'Locksley', 'Charlene', 'Emotional Security: A New Algorithm', 'New Moon Books'),
 ('648-92-1872', 'Blotchet-Halls', 'Reginald', 'Fifty Years in Buckingham Palace Kitchens', 'Binnet & Hardley'),
 ('672-71-3249', 'Yokomoto', 'Akiko', 'Sushi, Anyone?', 'Binnet & Hardley'),
 ('712-45-1867', 'del Castillo', 'Innes', 'Silicon Valley Gastronomic Treats', 'Binnet & Hardley'),
 ('722-51-5454', 'DeFrance', 'Michel', 'The Gourmet Microwave', 'Binnet & Hardley'),
 ('724-80-9391', 'MacFeather', 'Stearns', 'Cooking with Computers: Surreptitious Balance Sheets', 'Algodata Infosystems'),
 ('724-80-9391', 'MacFeather', 'Stearns', 'Computer Phobic AND Non-Phobic Individuals: Behavior Variations', 'Binnet & Hardley'),
 ('756-30-7391', 'Karsen', 'Livia', 'Computer Phobic AND Non-Phobic Individuals: Behavior Variations', 'Binnet & Hardley'),
 ('807-91-6654', 'Panteley', 'Sylvia', 'Onions, Leeks, and Garlic: Cooking Secrets of the Mediterranean', 'Binnet & Hardley'),
 ('846-92-7186', 'Hunter', 'Sheryl', 'Secrets of Silicon Valley', 'Algodata Infosystems'),
 ('899-46-2035', 'Ringer', 'Anne', 'The Gourmet Microwave', 'Binnet & Hardley'),
 ('899-46-2035', 'Ringer', 'Anne', 'Is Anger the Enemy?', 'New Moon Books'),
 ('998-72-3567', 'Ringer', 'Albert', 'Is Anger the Enemy?', 'New Moon Books'),
 ('998-72-3567', 'Ringer', 'Albert', 'Life Without Fear', 'New Moon Books')]

In [21]:
# check number of rows --> OK!

In [20]:
%%sql 
select  count(*)
from authors as a join titleauthor as ta on a.au_id = ta.au_id
               join titles as t on t.title_id = ta.title_id
               join publishers as p on p.pub_id = t.pub_id

 * sqlite:///publications.db
Done.

[(25,)]

## Challenge 2 - Who Have Published How Many At Where?

Query how many titles each author has published at each publisher.

In [92]:
%%sql
select a.au_id as 'AUTHOR ID', 
       a.au_lname as 'LAST NAME', 
       a.au_fname as 'FIRST NAME',       
       p.pub_name as 'PUBLISHER',
       count(*) as 'TITLE COUNT' 
        
from authors as a join titleauthor as ta on a.au_id=ta.au_id 
                  join titles as t on ta.title_id=t.title_id
                  join publishers as p on t.pub_id=p.pub_id

group by t.title
order by a.au_id desc

 * sqlite:///publications.db
Done.

[('998-72-3567', 'Ringer', 'Albert', 'New Moon Books', 1),
 ('899-46-2035', 'Ringer', 'Anne', 'New Moon Books', 2),
 ('807-91-6654', 'Panteley', 'Sylvia', 'Binnet & Hardley', 1),
 ('724-80-9391', 'MacFeather', 'Stearns', 'Binnet & Hardley', 2),
 ('722-51-5454', 'DeFrance', 'Michel', 'Binnet & Hardley', 2),
 ('712-45-1867', 'del Castillo', 'Innes', 'Binnet & Hardley', 1),
 ('648-92-1872', 'Blotchet-Halls', 'Reginald', 'Binnet & Hardley', 1),
 ('486-29-1786', 'Locksley', 'Charlene', 'Algodata Infosystems', 1),
 ('486-29-1786', 'Locksley', 'Charlene', 'New Moon Books', 1),
 ('427-17-2319', 'Dull', 'Ann', 'Algodata Infosystems', 2),
 ('274-80-9391', 'Straight', 'Dean', 'Algodata Infosystems', 1),
 ('267-41-2394', "O'Leary", 'Michael', 'Binnet & Hardley', 3),
 ('267-41-2394', "O'Leary", 'Michael', 'Algodata Infosystems', 2),
 ('238-95-7766', 'Carson', 'Cheryl', 'Algodata Infosystems', 1),
 ('213-46-8915', 'Green', 'Marjorie', 'New Moon Books', 1),
 ('213-46-8915', 'Green', 'Marjorie', 'Algodata Infosystems', 2),
 ('172-32-1176', 'White', 'Johnson', 'New Moon Books', 1)]

We wanted the results to return records for all the authors, regardless of whether they work with some publisher (LEFT JOIN)

In [93]:
# %%sql
# select a.au_id as 'AUTHOR ID', 
#        a.au_lname as 'LAST NAME', 
#        a.au_fname as 'FIRST NAME',       
#        p.pub_name as 'PUBLISHER',
#        count(*) as 'TITLE COUNT' 
        
# from authors as a left join titleauthor as ta on a.au_id=ta.au_id 
#                   left join titles as t on ta.title_id=t.title_id
#                   left join publishers as p on t.pub_id=p.pub_id
        
# group by t.title
# order by a.au_id desc

In [ ]:
# check number of rows --> OK!

In [94]:
%%sql
select count(t.title)        
from authors as a left join titleauthor as ta on a.au_id=ta.au_id 
                  left join titles as t on ta.title_id=t.title_id
                  left join publishers as p on t.pub_id=p.pub_id

 * sqlite:///publications.db
Done.

[(25,)]

## Challenge 3 - Best Selling Authors

Who are the top 3 authors who have sold the highest number of titles?

Requirements:

Your output should have the following columns:
- AUTHOR_ID - the ID of the author
- LAST_NAME - author last name
- FIRST_NAME - author first name
- TOTAL - total number of titles sold from this author

In [120]:
%%sql
select a.au_id as 'AUTHOR ID', 
       a.au_lname as 'LAST NAME', 
       a.au_fname as 'FIRST NAME',
       sum(s.qty) as 'TOTAL'
        
from authors as a join titleauthor as ta on a.au_id=ta.au_id 
                  join titles as t on ta.title_id=t.title_id
                  join sales as s on t.title_id=s.title_id

group by a.au_id
order by TOTAL desc
limit 3

 * sqlite:///publications.db
Done.

[('899-46-2035', 'Ringer', 'Anne', 148),
 ('998-72-3567', 'Ringer', 'Albert', 133),
 ('213-46-8915', 'Green', 'Marjorie', 50)]

## Challenge 4 - Best Selling Authors Ranking

In [151]:
# LEFT JOIN

In [150]:
%%sql
select a.au_id as 'AUTHOR ID', 
       a.au_lname as 'LAST NAME', 
       a.au_fname as 'FIRST NAME',
       sum(ifnull(s.qty,0)) as 'TOTAL'
       
               
from authors as a left join titleauthor as ta on a.au_id=ta.au_id 
                  left join titles as t on ta.title_id=t.title_id
                  left join sales as s on t.title_id=s.title_id
group by a.au_id
order by TOTAL desc

 * sqlite:///publications.db
Done.

[('899-46-2035', 'Ringer', 'Anne', 148),
 ('998-72-3567', 'Ringer', 'Albert', 133),
 ('213-46-8915', 'Green', 'Marjorie', 50),
 ('427-17-2319', 'Dull', 'Ann', 50),
 ('846-92-7186', 'Hunter', 'Sheryl', 50),
 ('267-41-2394', "O'Leary", 'Michael', 45),
 ('724-80-9391', 'MacFeather', 'Stearns', 45),
 ('722-51-5454', 'DeFrance', 'Michel', 40),
 ('807-91-6654', 'Panteley', 'Sylvia', 40),
 ('238-95-7766', 'Carson', 'Cheryl', 30),
 ('486-29-1786', 'Locksley', 'Charlene', 25),
 ('472-27-2349', 'Gringlesby', 'Burt', 20),
 ('648-92-1872', 'Blotchet-Halls', 'Reginald', 20),
 ('672-71-3249', 'Yokomoto', 'Akiko', 20),
 ('756-30-7391', 'Karsen', 'Livia', 20),
 ('172-32-1176', 'White', 'Johnson', 15),
 ('274-80-9391', 'Straight', 'Dean', 15),
 ('409-56-7008', 'Bennet', 'Abraham', 15),
 ('712-45-1867', 'del Castillo', 'Innes', 10),
 ('341-22-1782', 'Smith', 'Meander', 0),
 ('527-72-3246', 'Greene', 'Morningstar', 0),
 ('724-08-9931', 'Stringer', 'Dirk', 0),
 ('893-72-1158', 'McBadden', 'Heather', 0)]

In [147]:
# Trying to use ROW_NUMBER() --> DOESN'T WORK!

In [154]:
%%sql
select a.au_id as 'AUTHOR ID', 
       a.au_lname as 'LAST NAME', 
       a.au_fname as 'FIRST NAME',
       sum(ifnull(s.qty,0)) as 'TOTAL',
       row_number() over(partition by 'AUTHOR ID')
       
               
from authors as a left join titleauthor as ta on a.au_id=ta.au_id 
                  left join titles as t on ta.title_id=t.title_id
                  left join sales as s on t.title_id=s.title_id

 * sqlite:///publications.db
(sqlite3.OperationalError) misuse of aggregate: sum()
[SQL: select a.au_id as 'AUTHOR ID',
       a.au_lname as 'LAST NAME',
       a.au_fname as 'FIRST NAME',
       sum(ifnull(s.qty,0)) as 'TOTAL',
       row_number() over(partition by 'AUTHOR ID')


from authors as a left join titleauthor as ta on a.au_id=ta.au_id
                  left join titles as t on ta.title_id=t.title_id
                  left join sales as s on t.title_id=s.title_id]
(Background on this error at: http://sqlalche.me/e/e3q8)